app/controllers/forums_controller.rb

  def index
	  @forums = Forum.all
---
SELECT * FROM "forums"

  def create

	@forum = Forum.new(params[:forum])
	if @forum.save
---
INSERT INTO "forums" ("created_at", "title", "updated_at", "context") VALUES('2010-10-06 02:14:38', 'tt', '2010-10-06 02:14:38', 'ra')

  def show
	  @forum = Forum.find(params[:id])
---
SELECT * FROM "forums" WHERE ("forums"."id" = 1)

  def edit
	  @forum = Forum.find(params[:id])
---
SELECT * FROM "forums" WHERE ("forums"."id" = 1)

  def update
	  @forum = Forum.find(params[:id])
	  if @forum.update_attributes(params[:forum])
---
SELECT * FROM "forums" WHERE ("forums"."id" = 2)
UPDATE "forums" SET "updated_at" = '2010-10-05 10:24:14', "context" = '聊天吹水室' WHERE "id" = 2

  def destroy
    @forum = Forum.find(params[:id])
    @forum.delete
---
SELECT * FROM "forums" WHERE ("forums"."id" = 3)
DELETE FROM "forums" WHERE ("id" IN (3))