app/controllers/posts_controller.rb

  def index
    @posts = @forum.posts.paginate :page => params[:page]
---
SELECT * FROM "posts" WHERE ("posts".forum_id = 2) LIMIT 20 OFFSET 0
SELECT count(*) AS count_all FROM "posts" WHERE ("posts".forum_id = 2)

  def create

	@post = @forum.posts.build(params[:post])
	if @post.save
---
INSERT INTO "posts" ("created_at", "title", "updated_at", "forum_id", "user_id", "context") VALUES('2010-10-06 08:05:45', 'ttt', '2010-10-06 08:05:45', 4, 1, 'qqqq')

  def update
	  if @post.update_attributes(params[:post])
---
UPDATE "posts" SET "updated_at" = '2010-10-05 10:24:54', "context" = 'aaa', "title" = 'tt' WHERE "id" = 1

  def destroy
    @post.delete
---
DELETE FROM "posts" WHERE ("id" IN (2))

  def find_forum
    @forum = Forum.find(params[:forum_id])
---
SELECT * FROM "forums" WHERE ("forums"."id" = 6)

  def find_post
    @post = Post.find(params[:id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 2)